---

C#Visual BasicVisual C++

Revit 2024 API
---
FamilyInstance..::..RemoveCoping Method
FamilyInstance Class See Also Send Feedback
---

Removes a coping (cut) from a steel beam.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public bool RemoveCoping(
    	FamilyInstance cutter
    )

Visual Basic
---

    Public Function RemoveCoping ( _
    	cutter As FamilyInstance _
    ) As Boolean

Visual C++
---

    public:
    bool RemoveCoping(
    	FamilyInstance^ cutter
    )

#### Parameters

cutter
    Type: Autodesk.Revit.DB..::..FamilyInstanceA steel beam or column for which this beam currently has a coping cut. May not be nullNothingnullptra null reference (Nothing in Visual Basic) or itself.

# Remarks

This function corresponds to Tools -> Remove coping in Revit Structure.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when 'cutter' is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when 'cutter' refers to this instance. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when regeneration fails. |

# See Also

FamilyInstance Class

Autodesk.Revit.DB Namespace